import time
import sys


def print_lyrics():
    lyrics = [
        """  हर लकीर का मतलब किस्मत नहीं होता,
           कुछ निशान मेहनत के भी होते हैं।

          अब न जाने वो दिन कब हमारी जिंदगी में आएगा
          जब तू पास आकर मुस्कुराकर हमको गले लगाएगी।

          हम तन्हाइयों में आंसू बहाते हैं तेरी याद में,
          न जाने कब तू आकर हमको बहुत हंसाएगी।

          धीमी हो रही है धड़कनों की रफ्तार दिल में,
          न जाने कब तू हमको छूकर धड़कनों की रफ्तार बढ़ाएगी।

          मेरी दुनिया बे रंग हो गयी है,
          न जाने कब तू आकर इसे प्यार की खुश्बू से महकाएगी।

          अब हमसे इस दिल की बेचैनी बर्दाश्त नहीं होती,
          न जाने कब तू आकर हमारे दिल को सुकून दिलाएगी।

          घेरे रहती हैं हरदम हमको अब तो ये तन्हाईयां,
          न जाने कब तू आकर हमारे साथ वक्त बिताएगी।

          दुःखी करते रहते हैं हमको सारे गम,
          न जाने कब तू हमारे पास खुशियों की बहार लाएगी।

          कभी कभी होती है शक हमें तेरे प्यार पर,
          न जाने कब तू आकर हमें अपने प्यार का यकीन दिलाएगी।

          ये फासले कहीं ले न लें हमारी जान,
          न जाने कब तू आकर इन दूरियों को मिटाएगी।

          हम चल तो रहे हैं प्यार के रास्ते पर,
          न जाने कब तू मंज़िल बनकर राह में पाएगी। """ 
    ]

    delay = 1.0

    print("\n")
    time.sleep(1.4)

    for line in lyrics:
        for char in line:
            sys.stdout.write(char)
            sys.stdout.flush()
            time.sleep(0.05)
        print()
        time.sleep(delay)


print_lyrics()
